import { createMap } from '@/game/world/mapBuilder';

export const spawnMap = createMap({
  id: 'spawn',
  name: 'Portlock Beach',
  layers: [
    {
      id: 1,
      name: 'Base',
      tiles: [
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        ''
      ],
      rotations: [
        '01230003012',
        '32302110123',
        '00012301230',
        '00023012301',
        '00030123012',
        '02301230123',
        '00000030200',
        '23231100020',
        '00211310323'
      ],
      collisionEdges: [
        '00000000000',
        '00000000000',
        '00000000000',
        '00000000000',
        '00000000000',
        '00000000000',
        '00000000000',
        '11111300091',
        '00000311190'
      ]
    },
    {
      id: 2,
      name: 'NPC',
      tiles: [
        '...........',
        '...........',
        '...........',
        '...........',
        '...........',
        '...........',
        '...........',
        '...........',
        '...........'
      ],
      collision: false
    },
    {
      id: 3,
      name: 'Trees',
      tiles: [
        '...',
        '...........',
        '.........',
        '.......',
        '.......',
        '.........',
        '..........',
        '...........',
        '...........'
      ],
      collisionEdges: [
        '4f46000c444',
        '00000000000',
        '00000000000',
        '00000009300',
        '0930000c600',
        '0c600000000',
        '0000000f000',
        '00000000000',
        '00000000000'
      ]
    }
  ],
  warps: [
    {
      id: 'to-portlock',
      to: {
        x: 8,
        y: 13
      },
      from: {
        x: 4,
        y: 0
      },
      label: 'To Portlock',
      toMapId: 'portlock',
      toPositions: [
        {
          x: 8,
          y: 13
        },
        {
          x: 9,
          y: 13
        },
        {
          x: 10,
          y: 13
        }
      ],
      fromPositions: [
        {
          x: 4,
          y: 0
        },
        {
          x: 5,
          y: 0
        },
        {
          x: 6,
          y: 0
        }
      ],
      requiredFacing: 'up',
      requireInteract: false
    }
  ],
  encounterGroups: [
    {
      id: 'fishing-group',
      tilePositions: [
        {
          x: 0,
          y: 7
        },
        {
          x: 1,
          y: 7
        },
        {
          x: 2,
          y: 7
        },
        {
          x: 3,
          y: 7
        },
        {
          x: 4,
          y: 7
        },
        {
          x: 5,
          y: 7
        },
        {
          x: 0,
          y: 8
        },
        {
          x: 2,
          y: 8
        },
        {
          x: 1,
          y: 8
        },
        {
          x: 3,
          y: 8
        },
        {
          x: 4,
          y: 8
        },
        {
          x: 5,
          y: 8
        },
        {
          x: 6,
          y: 8
        },
        {
          x: 7,
          y: 8
        },
        {
          x: 8,
          y: 8
        },
        {
          x: 9,
          y: 8
        },
        {
          x: 10,
          y: 8
        },
        {
          x: 10,
          y: 7
        },
        {
          x: 9,
          y: 7
        }
      ],
      walkEncounterTableId: null,
      fishEncounterTableId: 'germania-fishing',
      walkFrequency: 0,
      fishFrequency: 0.5
    }
  ]
});
